<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
use App\Models\Majors;


class MajorsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        //majors
        $majorSeed = [
            ['faculty_name' => 'คณะมนุษยศาสตร์และสังคมศาสตร์', 'major_name' => 'สาขาวิชาการพัฒนาชุมชน'],
            ['faculty_name' => 'คณะมนุษยศาสตร์และสังคมศาสตร์', 'major_name' => 'สาขาวิชาภาษาอังกฤษธุรกิจ'],
            ['faculty_name' => 'คณะมนุษยศาสตร์และสังคมศาสตร์', 'major_name' => 'สาขาวิชาภาษาญี่ปุ่น'],
            ['faculty_name' => 'คณะมนุษยศาสตร์และสังคมศาสตร์', 'major_name' => 'สาขาวิชาภาษาจีน'],
            ['faculty_name' => 'คณะมนุษยศาสตร์และสังคมศาสตร์', 'major_name' => 'สาขาวิชาการจัดการสารสนเทศดิจิทัล'],
            ['faculty_name' => 'คณะมนุษยศาสตร์และสังคมศาสตร์', 'major_name' => 'สาขาวิชาศิลปะและการออกแบบ'],
            ['faculty_name' => 'คณะมนุษยศาสตร์และสังคมศาสตร์', 'major_name' => 'สาขาวิชาประวัติศาสตร์'],
            ['faculty_name' => 'คณะมนุษยศาสตร์และสังคมศาสตร์', 'major_name' => 'สาขาวิชาภาษาไทยเพื่อการสื่อสาร'],
            ['faculty_name' => 'คณะมนุษยศาสตร์และสังคมศาสตร์', 'major_name' => 'สาขาวิชานิเทศศาสตร์'],
            ['faculty_name' => 'คณะพยาบาลศาสตร์', 'major_name' => 'หลักสูตรพยาบาลศาสตรบัณฑิต'],
            ['faculty_name' => 'วิทยาลัยกฎหมายและการปกครอง', 'major_name' => 'หลักสูตรสาขาวิชานิติศาสตรบัณฑิต'],
            ['faculty_name' => 'วิทยาลัยกฎหมายและการปกครอง', 'major_name' => 'หลักสูตรสาขาวิชารัฐศาสตรบัณฑิต'],
            ['faculty_name' => 'วิทยาลัยกฎหมายและการปกครอง', 'major_name' => 'หลักสูตรสาขาวิชารัฐประศาสนศาสตรบัณฑิต'],
            ['faculty_name' => 'คณะบริหารธุรกิจและการบัญชี', 'major_name' => 'สาขาวิชาการจัดการ'],
            ['faculty_name' => 'คณะบริหารธุรกิจและการบัญชี', 'major_name' => 'สาขาวิชาการตลาด'],
            ['faculty_name' => 'คณะบริหารธุรกิจและการบัญชี', 'major_name' => 'สาขาวิชาคอมพิวเตอร์ธุรกิจดิจิทัล'],
            ['faculty_name' => 'คณะบริหารธุรกิจและการบัญชี', 'major_name' => 'สาขาวิชาการบริหารธุรกิจระหว่างประเทศ'],
            ['faculty_name' => 'คณะบริหารธุรกิจและการบัญชี', 'major_name' => 'สาขาวิชาการจัดการธุรกิจการค้าสมัยใหม่'],
            ['faculty_name' => 'คณะบริหารธุรกิจและการบัญชี', 'major_name' => 'สาขาวิชาบัญชี'],
            ['faculty_name' => 'คณะบริหารธุรกิจและการบัญชี', 'major_name' => 'สาขาวิชาการท่องเที่ยวและการโรงแรม'],
            ['faculty_name' => 'คณะครุศาสตร์', 'major_name' => 'สาขาวิชาภาษาอังกฤษ'],
            ['faculty_name' => 'คณะครุศาสตร์', 'major_name' => 'สาขาวิชาการศึกษาปฐมวัย'],
            ['faculty_name' => 'คณะครุศาสตร์', 'major_name' => 'สาขาวิชาคอมพิวเตอร์ศึกษา'],
            ['faculty_name' => 'คณะครุศาสตร์', 'major_name' => 'สาขาวิชาคณิตศาสตร์'],
            ['faculty_name' => 'คณะครุศาสตร์', 'major_name' => 'สาขาวิชาประถมศึกษา'],
            ['faculty_name' => 'คณะครุศาสตร์', 'major_name' => 'สาขาวิชาภาษาไทย'],
            ['faculty_name' => 'คณะครุศาสตร์', 'major_name' => 'สาขาวิชาสังคมศึกษา'],
            ['faculty_name' => 'คณะครุศาสตร์', 'major_name' => 'สาขาวิชาวิทยาศาสตร์ทั่วไป'],
            ['faculty_name' => 'คณะครุศาสตร์', 'major_name' => 'สาขาวิชาพลศึกษา'],
            ['faculty_name' => 'คณะครุศาสตร์', 'major_name' => 'สาขาวิชาดนตรีศึกษา'],
            ['faculty_name' => 'คณะครุศาสตร์', 'major_name' => 'สาขาวิชาการสอนภาษาจีน'],
            ['faculty_name' => 'คณะครุศาสตร์', 'major_name' => 'สาขาวิชาฏศิลป์ศึกษา'],
            ['faculty_name' => 'คณะครุศาสตร์', 'major_name' => 'สาขาการบริหารการศึกษา'],
            ['faculty_name' => 'คณะศิลปศาสตร์และวิทยาศาสตร์', 'major_name' => 'สาขาวิชาวิทยาการคอมพิวเตอร์'],
            ['faculty_name' => 'คณะศิลปศาสตร์และวิทยาศาสตร์', 'major_name' => 'สาขาวิชาเทคโนโลยีคอมพิวเตอร์และดิจิทัล'],
            ['faculty_name' => 'คณะศิลปศาสตร์และวิทยาศาสตร์', 'major_name' => 'สาขาวิชาสาธารณสุขชุมชน'],
            ['faculty_name' => 'คณะศิลปศาสตร์และวิทยาศาสตร์', 'major_name' => 'สาขาวิชาวิทยาศาสตร์การกีฬา'],
            ['faculty_name' => 'คณะศิลปศาสตร์และวิทยาศาสตร์', 'major_name' => 'สาขาวิชาเทคโนโลยีการเกษตร'],
            ['faculty_name' => 'คณะศิลปศาสตร์และวิทยาศาสตร์', 'major_name' => 'สาขาวิชาเทคโนโลยีและนวัตกรรมอาหาร'],
            ['faculty_name' => 'คณะศิลปศาสตร์และวิทยาศาสตร์', 'major_name' => 'สาขาวิชาอาชีวอนามัยและความปลอดภัย'],
            ['faculty_name' => 'คณะศิลปศาสตร์และวิทยาศาสตร์', 'major_name' => 'สาขาวิชาวิศวกรรมซอฟต์แวร์'],
            ['faculty_name' => 'คณะศิลปศาสตร์และวิทยาศาสตร์', 'major_name' => 'สาขาวิชาวิศวกรรมโลจิสติกส์'],
            ['faculty_name' => 'คณะศิลปศาสตร์และวิทยาศาสตร์', 'major_name' => 'สาขาวิชาวิศวกรรมการจัดการอุตสาหกรรมและสิ่งแวดล้อม'],
            ['faculty_name' => 'คณะศิลปศาสตร์และวิทยาศาสตร์', 'major_name' => 'สาขาวิชาการออกแบบผลิตภัณฑ์และนวัตกรรมวัสดุ'],
            ['faculty_name' => 'คณะศิลปศาสตร์และวิทยาศาสตร์', 'major_name' => 'สาขาวิชาเทคโนโลยีโยธาและสถาปัตยกรรม'],
        ];
        
        foreach ($majorSeed as $major) {
            Majors::create($major);
        }

    }
}
